---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetAnalyticalModelData
source: html/4c492289-beea-37b3-77c6-d27a5b389c6c.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetAnalyticalModelData Method

Gets the analytical model data at the current iteration step.

## Syntax (C#)
```csharp
public MEPAnalyticalModelData GetAnalyticalModelData()
```

## Returns
The retrieved model data.